app/controllers/chapters_controller.rb

  def index
    @chapters = Chapter.all
---
SELECT * FROM "chapters"

  def show
    @chapter = Chapter.find(params[:id])
---
SELECT * FROM "chapters" WHERE ("chapters"."id" = 980190962)

  def edit
    @chapter = Chapter.find(params[:id])
---
SELECT * FROM "chapters" WHERE ("chapters"."id" = 980190962)

  def create
    @chapter = Chapter.new(params[:chapter])
    @comic = Comic.find(params[:comic_id])

    @chapter.comic = @comic

    respond_to do |format|
      if @chapter.save
---
INSERT INTO "chapters" ("comic_id", "created_at", "updated_at") VALUES(NULL, '2012-08-20 00:46:36', '2012-08-20 00:46:36')

  def update
    @chapter = Chapter.find(params[:id])
---
SELECT * FROM "chapters" WHERE ("chapters"."id" = 980190962)

  def destroy
    @chapter = Chapter.find(params[:id])
    @chapter.destroy
---
SELECT * FROM "chapters" WHERE ("chapters"."id" = 980190962)
DELETE FROM "chapters" WHERE "id" = 980190962