app/controllers/comics_controller.rb

SELECT * FROM "comics"
---
  def index
    @comics = Comic.all

SELECT * FROM "comics" WHERE ("comics"."id" = 980190962)
---
  def show
    @comic = Comic.find(params[:id])

SELECT * FROM "comics" WHERE ("comics"."id" = 980190962)
---
  def edit
    @comic = Comic.find(params[:id])

INSERT INTO "comics" ("created_at", "updated_at") VALUES('2012-07-15 23:43:15', '2012-07-15 23:43:15')
---
  def create
    @comic = Comic.new(params[:comic])

    respond_to do |format|
      if @comic.save

SELECT * FROM "comics" WHERE ("comics"."id" = 980190962)
---
  def update
    @comic = Comic.find(params[:id])

SELECT * FROM "comics" WHERE ("comics"."id" = 980190962)
DELETE FROM "comics" WHERE "id" = 980190962
---
  def destroy
    @comic = Comic.find(params[:id])
    @comic.destroy