app/controllers/pages_controller.rb

  def index
    @pages = Page.all
---
SELECT * FROM "pages"

  def show
    @page = Page.find(params[:id])
---
SELECT * FROM "pages" WHERE ("pages"."id" = 980190962)

  def edit
    @page = Page.find(params[:id])
---
SELECT * FROM "pages" WHERE ("pages"."id" = 980190962)

  def create
    @page = Page.new(params[:page])
    @comic = Comic.find(params[:comic_id])
    @chapter = Chapter.find(params[:chapter_id])

    @page.chapter = @chapter

    respond_to do |format|
      if @page.save
---
INSERT INTO "pages" ("comic_strip_content_type", "comic_strip_updated_at", "comic_strip_file_size", "page_number", "created_at", "comic_strip_file_name", "updated_at", "chapter_id") VALUES(NULL, NULL, NULL, NULL, '2012-08-20 00:46:36', NULL, '2012-08-20 00:46:36', NULL)

  def update
    @page = Page.find(params[:id])
---
SELECT * FROM "pages" WHERE ("pages"."id" = 980190962)

  def destroy
    @page = Page.find(params[:id])
    @page.destroy
---
SELECT * FROM "pages" WHERE ("pages"."id" = 980190962)
DELETE FROM "pages" WHERE "id" = 980190962